// First Launch

WEIGHT_UNIT = "Weight Unit";
POUNDS = "Pounds (lb)";
KILOGRAMS = "Kilograms (kg)";
STONES = "Stones (st)";

ENERGY_UNIT = "Energy Unit";
CALORIES = "Calories (cal)";
KILOJOULES = "Kilojoules (kJ)";

SCALE_INCREMENT = "Scale Increment";

NEW_DATABASE_DISMISS = "Weigh-in Now";
NEW_DATABASE_DISMISS_FOOTER = "You can change units at any time using the Settings application.";

// Log Tab

LOG_VIEW_TITLE = "Log";
MONTH_YEAR_DATE_FORMAT = "MMMM y"; // also used in Chart View
STONE_FORMAT = "%dst %@lb";
POUNDS_UNIT_SUFFIX = " lb";
KILOGRAMS_UNIT_SUFFIX = " kg";
TREND_FORMAT = "+0.0;−#";

// Trends Tab

TRENDS_VIEW_TITLE = "Trends";
NO_DATA_FOR_TRENDS = "There must be at least two weight measurements in the past year to display trends.";
POUNDS_PER_WEEK_FORMAT = "+#,##0.00 lbs/week;−# lbs/week";
KILOGRAMS_PER_WEEK_FORMAT = "+#,##0.00 kgs/week;−# kgs/week";
CALORIES_PER_DAY_FORMAT = "+#,##0 cal/day (eating);−# cal/day (burning)";
KILOJOULES_PER_DAY_FORMAT = "+#,##0 kJ/day (eating);−# kJ/day (burning)";

// Goal tab

GOAL_VIEW_TITLE = "Goal";
START_SECTION_TITLE = "Start";
GOAL_SECTION_TITLE = "Goal";
PLAN_SECTION_TITLE = "Plan";
START_DATE = "Start Date";
START_WEIGHT = "Start Weight";
GOAL_DATE = "Goal Date";
GOAL_WEIGHT = "Goal Weight";
ENERGY_CHANGE_TITLE = "Energy Plan";
WEIGHT_CHANGE_TITLE = "Weight Plan";
GOAL_NO_WEIGHT_WARNING = "You must enter at least one day of weight measurements to set a goal.";

// More Tab

MORE_VIEW_TITLE = "More";
MORE_SECTION_TITLE = "More";
TRANSFER_SECTION_TITLE = "Transfer";
SUPPORT_SECTION_TITLE = "Support";
WEIGHT_GRAPH_ROW_TITLE = "Weight Chart";
WEIGHT_GRAPH_ROW_MESSAGE = "While using FatWatch, rotate iPhone sideways to see a chart of your weight over time.";
PASSCODE_ROW_TITLE = "Require Passcode";
BMI_ROW_TITLE = "Enable BMI";
WIFI_ROW_TITLE = "Wi-Fi Import/Export";
WIFI_ROW_MESSAGE = "Make sure FatWatch and your computer are on the same Wi-Fi network, then enter this address into a web browser on your computer.";
SUPPORT_WEBSITE_TITLE = "www.fatwatchapp.com";
SUPPORT_WEBSITE_URL = "http://www.fatwatchapp.com/support";
SUPPORT_EMAIL_TITLE = "support@fatwatchapp.com";
SUPPORT_EMAIL_URL = "mailto:support@fatwatchapp.com?subject=FatWatch%%20%@";

// Chart View

GRAPH_VIEW_TITLE = "Chart";
NO_DATA_FOR_GRAPH = "You must enter at least two days of weight measurements to display a chart."; 

// Wi-Fi Import

PRE_IMPORT_TITLE = "Import Pending";
PRE_IMPORT_TEXT = "Weight data was received from a computer, do you want to import it?";
CANCEL_BUTTON = "Cancel";
REPLACE_BUTTON = "Replace";
MERGE_BUTTON = "Merge";

POST_IMPORT_TITLE = "Import Complete";
POST_IMPORT_TEXT_COUNT = "%d measurements imported and skipped %d lines.";
POST_IMPORT_TEXT_NONE = "No measurements imported and skipped %d lines.  File format may be incorrect.";
OK_BUTTON = "OK";
